target/karate-reports/features.Create-Appoitnment.karate-json.txt

{"failedCount":0,"prefixedPath":"classpath:features\/Create-Appoitnment.feature","packageQualifiedName":"features.Create-Appoitnment","loopIndex":-1,"relativePath":"features\/Create-Appoitnment.feature","scenarioResults":[{"sectionIndex":0,"stepResults":[{"result":{"nanos":2172200,"startTime":1753772335179,"endTime":1753772335181,"millis":2.1722,"status":"passed"},"step":{"background":true,"line":4,"prefix":"*","index":0,"text":"url userSoapUrl"},"stepLog":"12:28:55.113 🔢 Users to create: 5 \n"},{"result":{"nanos":5328100,"startTime":1753772335186,"endTime":1753772335191,"millis":5.3281,"status":"passed"},"step":{"background":true,"line":5,"prefix":"*","index":1,"text":"def username = 'xyz2313490priyankatalekar5@qa-u56-singlenode-ps.eng.zimbra.com'"}},{"result":{"nanos":3146400,"startTime":1753772335193,"endTime":1753772335196,"millis":3.1464,"status":"passed"},"step":{"background":true,"line":6,"prefix":"*","index":2,"text":"def password = 'Welcome123'"}},{"result":{"nanos":379966700,"startTime":1753772335196,"endTime":1753772335576,"millis":379.9667,"status":"passed"},"step":{"background":true,"line":7,"prefix":"*","index":3,"text":"configure ssl = true"}},{"result":{"nanos":1911300,"startTime":1753772335577,"endTime":1753772335579,"millis":1.9113,"status":"passed"},"step":{"comments":["# Step 1: Authenticate user and extract tokens"],"background":true,"line":10,"prefix":"*","index":4,"text":"def authType = 'name'"}},{"result":{"nanos":2889400,"startTime":1753772335579,"endTime":1753772335582,"millis":2.8894,"status":"passed"},"step":{"background":true,"line":11,"prefix":"*","index":5,"text":"def accountValue = username"}},{"result":{"nanos":143449100,"startTime":1753772335584,"endTime":1753772335727,"millis":143.4491,"status":"passed"},"step":{"background":true,"line":12,"prefix":"*","index":6,"text":"def loginRequest = read('classpath:requests\/authRequestUser.xml')"}},{"result":{"nanos":1117700,"startTime":1753772335727,"endTime":1753772335728,"millis":1.1177,"status":"passed"},"step":{"background":true,"line":13,"prefix":"Given","index":7,"text":"request loginRequest"}},{"result":{"nanos":1017300,"startTime":1753772335729,"endTime":1753772335730,"millis":1.0173,"status":"passed"},"step":{"background":true,"line":14,"prefix":"And","index":8,"text":"header Content-Type = 'application\/soap+xml'"}},{"result":{"nanos":907032800,"startTime":1753772335730,"endTime":1753772336637,"millis":907.0328,"status":"passed"},"step":{"background":true,"line":15,"prefix":"When","index":9,"text":"method POST"},"stepLog":"12:28:56.137 request:\n1 > POST https:\/\/80.225.207.85\/service\/soap\/\n1 > Content-Type: application\/soap+xml; charset=UTF-8\n1 > Content-Length: 359\n1 > Host: 80.225.207.85\n1 > Connection: Keep-Alive\n1 > User-Agent: Apache-HttpClient\/4.5.14 (Java\/21.0.7)\n1 > Accept-Encoding: gzip,deflate\n<soap:Envelope xmlns:soap=\"http:\/\/www.w3.org\/2003\/05\/soap-envelope\">\r\n  <soap:Header\/>\r\n  <soap:Body>\r\n    <AuthRequest xmlns=\"urn:zimbraAccount\" csrfTokenSecured=\"1\">\r\n      <account by=\"name\">xyz2313490priyankatalekar5@qa-u56-singlenode-ps.eng.zimbra.com<\/account>\r\n      <password>Welcome123<\/password>\r\n    <\/AuthRequest>\r\n  <\/soap:Body>\r\n<\/soap:Envelope>\n\n12:28:56.624 response time in milliseconds: 468\n1 < 200\n1 < Server: nginx\n1 < Date: Tue, 29 Jul 2025 06:58:55 GMT\n1 < Content-Type: text\/xml;charset=utf-8\n1 < Content-Length: 700\n1 < Connection: keep-alive\n1 < Set-Cookie: ZM_AUTH_TOKEN=0_8dbdedd356eb6e2f12cdd7ac9e5302e51fd5d12b_69643d33363a38303439303461372d346463302d346365642d626437332d6136393836376563653234383b6578703d31333a313735333934353133353338333b747970653d363a7a696d6272613b753d313a613b7469643d393a3633393536383530313b76657273696f6e3d31343a31302e312e305f47415f343635353b637372663d313a313b; Path=\/; Secure; HttpOnly\n1 < Expires: Thu, 01 Jan 1970 00:00:00 GMT\n1 < X-Zimbra-Csrf-Token: 0_8e7e14f65c3c29a38c5dcbede30c01a9be60f829\n1 < Cache-Control: no-store, no-cache\n1 < Vary: Accept-Encoding, User-Agent\n<soap:Envelope xmlns:soap=\"http:\/\/www.w3.org\/2003\/05\/soap-envelope\"><soap:Header><context xmlns=\"urn:zimbra\"><change token=\"1202\"\/><\/context><\/soap:Header><soap:Body><AuthResponse xmlns=\"urn:zimbraAccount\"><authToken>0_8dbdedd356eb6e2f12cdd7ac9e5302e51fd5d12b_69643d33363a38303439303461372d346463302d346365642d626437332d6136393836376563653234383b6578703d31333a313735333934353133353338333b747970653d363a7a696d6272613b753d313a613b7469643d393a3633393536383530313b76657273696f6e3d31343a31302e312e305f47415f343635353b637372663d313a313b<\/authToken><lifetime>172799999<\/lifetime><skin>harmony<\/skin><csrfToken>0_8e7e14f65c3c29a38c5dcbede30c01a9be60f829<\/csrfToken><\/AuthResponse><\/soap:Body><\/soap:Envelope>\n\n"},{"result":{"nanos":17173500,"startTime":1753772336637,"endTime":1753772336654,"millis":17.1735,"status":"passed"},"step":{"background":true,"line":16,"prefix":"Then","index":10,"text":"status 200"}},{"result":{"nanos":113112000,"startTime":1753772336655,"endTime":1753772336768,"millis":113.112,"status":"passed"},"step":{"background":true,"line":17,"prefix":"*","index":11,"text":"def userAuthToken = karate.xmlPath(response, '\/\/authToken')"}},{"result":{"nanos":4683200,"startTime":1753772336768,"endTime":1753772336773,"millis":4.6832,"status":"passed"},"step":{"background":true,"line":18,"prefix":"*","index":12,"text":"print 'Auth Token is:', userAuthToken"},"stepLog":"12:28:56.771 [print] Auth Token is: 0_8dbdedd356eb6e2f12cdd7ac9e5302e51fd5d12b_69643d33363a38303439303461372d346463302d346365642d626437332d6136393836376563653234383b6578703d31333a313735333934353133353338333b747970653d363a7a696d6272613b753d313a613b7469643d393a3633393536383530313b76657273696f6e3d31343a31302e312e305f47415f343635353b637372663d313a313b \n"},{"result":{"nanos":12258000,"startTime":1753772336773,"endTime":1753772336785,"millis":12.258,"status":"passed"},"step":{"background":true,"line":19,"prefix":"*","index":13,"text":"def csfrToken = karate.xmlPath(response,'\/\/csrfToken')"}},{"result":{"nanos":2881800,"startTime":1753772336785,"endTime":1753772336788,"millis":2.8818,"status":"passed"},"step":{"background":true,"line":20,"prefix":"*","index":14,"text":"print 'csrfToken is:', csfrToken"},"stepLog":"12:28:56.788 [print] csrfToken is: 0_8e7e14f65c3c29a38c5dcbede30c01a9be60f829 \n"},{"result":{"nanos":710400,"startTime":1753772336788,"endTime":1753772336789,"millis":0.7104,"status":"passed"},"step":{"background":true,"line":21,"prefix":"*","index":15,"text":"def authToken = userAuthToken"}},{"result":{"nanos":465100,"startTime":1753772336789,"endTime":1753772336789,"millis":0.4651,"status":"passed"},"step":{"background":true,"line":22,"prefix":"*","index":16,"text":"def csrfToken = csfrToken"}},{"result":{"nanos":364600,"startTime":1753772336790,"endTime":1753772336790,"millis":0.3646,"status":"passed"},"step":{"comments":["# Step 2: Setup dynamic appointment parameters"],"background":true,"line":25,"prefix":"*","index":17,"text":"def test_account1 = username"}},{"result":{"nanos":1075300,"startTime":1753772336790,"endTime":1753772336791,"millis":1.0753,"status":"passed"},"step":{"background":true,"line":26,"prefix":"*","index":18,"text":"def test_account2 = 'qauser_f8b093fa@qa-u56-singlenode-ps.eng.zimbra.com'"}},{"result":{"nanos":31708800,"startTime":1753772336791,"endTime":1753772336823,"millis":31.7088,"status":"passed"},"step":{"endLine":35,"background":true,"line":27,"prefix":"*","docString":"{\n  subject: 'SOAP Appointment Subject',\n  location: 'Room 101',\n  content: 'This is the appointment content'\n}","index":19,"text":"def appointment ="}},{"result":{"nanos":773100,"startTime":1753772336823,"endTime":1753772336824,"millis":0.7731,"status":"passed"},"step":{"background":true,"line":36,"prefix":"*","index":20,"text":"def organizer = test_account1"}},{"result":{"nanos":442900,"startTime":1753772336824,"endTime":1753772336824,"millis":0.4429,"status":"passed"},"step":{"background":true,"line":37,"prefix":"*","index":21,"text":"def attendee = test_account2"}},{"result":{"nanos":1114000,"startTime":1753772336824,"endTime":1753772336825,"millis":1.114,"status":"passed"},"step":{"background":true,"line":38,"prefix":"*","index":22,"text":"def startTime = '20250723T080000Z'"}},{"result":{"nanos":765400,"startTime":1753772336825,"endTime":1753772336826,"millis":0.7654,"status":"passed"},"step":{"background":true,"line":39,"prefix":"*","index":23,"text":"def endTime = '20250723T083000Z'"}},{"result":{"nanos":19854000,"startTime":1753772336826,"endTime":1753772336846,"millis":19.854,"status":"passed"},"step":{"comments":["# Step 3: Read SOAP body with #(...) variable substitution"],"background":true,"line":43,"prefix":"*","index":24,"text":"def requestBody = read('classpath:requests\/createAppointmentRequest.xml')"}},{"result":{"nanos":405900,"startTime":1753772336847,"endTime":1753772336847,"millis":0.4059,"status":"passed"},"step":{"line":48,"prefix":"Given","index":0,"text":"request requestBody"}},{"result":{"nanos":1030100,"startTime":1753772336848,"endTime":1753772336849,"millis":1.0301,"status":"passed"},"step":{"line":49,"prefix":"And","index":1,"text":"header Content-Type = 'application\/soap+xml'"}},{"result":{"nanos":195050600,"startTime":1753772336849,"endTime":1753772337044,"millis":195.0506,"status":"passed"},"step":{"line":50,"prefix":"When","index":2,"text":"method POST"},"stepLog":"12:28:56.861 request:\n2 > POST https:\/\/80.225.207.85\/service\/soap\/\n2 > Content-Type: application\/soap+xml; charset=UTF-8\n2 > Cookie: ZM_AUTH_TOKEN=0_8dbdedd356eb6e2f12cdd7ac9e5302e51fd5d12b_69643d33363a38303439303461372d346463302d346365642d626437332d6136393836376563653234383b6578703d31333a313735333934353133353338333b747970653d363a7a696d6272613b753d313a613b7469643d393a3633393536383530313b76657273696f6e3d31343a31302e312e305f47415f343635353b637372663d313a313b\n2 > Content-Length: 1366\n2 > Host: 80.225.207.85\n2 > Connection: Keep-Alive\n2 > User-Agent: Apache-HttpClient\/4.5.14 (Java\/21.0.7)\n2 > Accept-Encoding: gzip,deflate\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\r\n  <soap:Header>\r\n    <context xmlns=\"urn:zimbra\">\r\n      <authToken>0_8dbdedd356eb6e2f12cdd7ac9e5302e51fd5d12b_69643d33363a38303439303461372d346463302d346365642d626437332d6136393836376563653234383b6578703d31333a313735333934353133353338333b747970653d363a7a696d6272613b753d313a613b7469643d393a3633393536383530313b76657273696f6e3d31343a31302e312e305f47415f343635353b637372663d313a313b<\/authToken>\r\n      <csrfToken>0_8e7e14f65c3c29a38c5dcbede30c01a9be60f829<\/csrfToken>\r\n    <\/context>\r\n  <\/soap:Header>\r\n  <soap:Body>\r\n    <CreateAppointmentRequest xmlns=\"urn:zimbraMail\">\r\n      <m>\r\n        <inv allDay=\"0\" fb=\"B\" loc=\"Room 101\" method=\"REQUEST\" name=\"SOAP Appointment Subject\" transp=\"O\" type=\"event\">\r\n          <at a=\"qauser_f8b093fa@qa-u56-singlenode-ps.eng.zimbra.com\" ptst=\"NE\" role=\"OPT\" rsvp=\"1\"\/>\r\n          <s d=\"20250723T080000Z\"\/>\r\n          <e d=\"20250723T083000Z\"\/>\r\n          <or a=\"xyz2313490priyankatalekar5@qa-u56-singlenode-ps.eng.zimbra.com\"\/>\r\n        <\/inv>\r\n        <e a=\"qauser_f8b093fa@qa-u56-singlenode-ps.eng.zimbra.com\" t=\"t\"\/>\r\n        <mp content-type=\"text\/plain\">\r\n          <content>This is the appointment content<\/content>\r\n        <\/mp>\r\n        <su>SOAP Appointment Subject<\/su>\r\n      <\/m>\r\n    <\/CreateAppointmentRequest>\r\n  <\/soap:Body>\r\n<\/soap:Envelope>\n\n12:28:57.036 response time in milliseconds: 172\n2 < 200\n2 < Server: nginx\n2 < Date: Tue, 29 Jul 2025 06:58:55 GMT\n2 < Content-Type: text\/xml;charset=utf-8\n2 < Content-Length: 313\n2 < Connection: keep-alive\n2 < Cache-Control: no-store, no-cache\n2 < Vary: Accept-Encoding, User-Agent\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><soap:Header><context xmlns=\"urn:zimbra\"><change token=\"1205\"\/><\/context><\/soap:Header><soap:Body><CreateAppointmentResponse calItemId=\"303\" rev=\"1203\" ms=\"1203\" invId=\"303-302\" apptId=\"303\" xmlns=\"urn:zimbraMail\"\/><\/soap:Body><\/soap:Envelope>\n\n"},{"result":{"nanos":36700,"startTime":1753772337044,"endTime":1753772337044,"millis":0.0367,"status":"passed"},"step":{"line":51,"prefix":"Then","index":3,"text":"status 200"}},{"result":{"nanos":50829200,"startTime":1753772337044,"endTime":1753772337095,"millis":50.8292,"status":"passed"},"step":{"line":52,"prefix":"And","index":4,"text":"match response \/Envelope\/Body\/CreateAppointmentResponse != null"}}],"line":47,"description":"","durationMillis":1902.7656,"failed":false,"tags":["Sanity"],"executorName":"main","name":"Create appointment with auth and test accounts","startTime":1753772334768,"refId":"[1:47]","endTime":1753772337095,"exampleIndex":-1}],"callDepth":0,"name":"Create Zimbra Appointment using karate.read()","description":"","resultDate":"2025-07-29 12:28:57 pm","durationMillis":1902.7656,"passedCount":1}